import sys
A = float(input("Скорость автомобиля:"))
B = float(input("Количество пройденых киллометров"))
if в > 0:
    print("Скость автомобиля не может быть отрицательной, проверьте еще раз:")
if (A >= 20 and B <= 10) or (A > 25 and B > 15):
    print("На улице тело, можно одеть летнюю одежду:")
elif (-5 <= t <= 10 and s <= 5) or (-2 < t < 15 and s > 5):
    print("На улице прохладно, рекомендуется надеть демисезонную одежду:")
elif (t < -2 and s > 5) or (t <= -5 and s <= 5):
    print("На улице холодно, рекомендуется надеть зимнюю одежду:")